Tekla Open API Reference for Tekla Structures 2025
PickerInputTwoPoints Class
 The PickerInputTwoPoints class represents a pick of two points in a view. Used for values asked by UI.Picker.PickTwoPoints(string FirstPrompt, string SecondPrompt, out Point FirstPickedPoint, out Point SecondPickedPoint, out ViewBase PickedView).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputWithinAView
 Tekla.Structures.Drawing.PickerInputPointsWithinAView
 Tekla.Structures.Drawing.PickerInputTwoPoints
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PickerInputTwoPoints : PickerInputPointsWithinAView
Public Class PickerInputTwoPoints
	Inherits PickerInputPointsWithinAView
The PickerInputTwoPoints type exposes the following members.
Constructors
Name | Description
PickerInputTwoPoints
 Creates a new PickerInputTwoPoints instance with two points selected in a view.
Top
Properties
Name | Description
FirstPickedPoint
 The first picked point in the view coordinates.
PickedView
 The view within which the pick occurred.
 (Inherited from PickerInputWithinAView.)
SecondPickedPoint
 The second picked point in the view coordinates.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PickerInputPointsWithinAView.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace